KeyDB_test_by_memtier_benchmark/KeyDB_test_by_memtier_benchmark_I_OFF/PrepareData_KeyDB_test_I_OFF_20230414172254.txt
50        Threads
8         Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       219720.69          ---          ---        59.51618        47.10300       218.11100       350.20700     71185.10 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     219720.69         0.00         0.00        59.51618        47.10300       218.11100       350.20700     71185.10 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.215        0.000
SET      19.199        5.000
SET      30.719       10.000
SET      34.559       15.000
SET      36.607       20.000
SET      38.399       25.000
SET      39.935       30.000
SET      41.471       35.000
SET      43.263       40.000
SET      45.055       45.000
SET      47.103       50.000
SET      48.383       52.500
SET      49.663       55.000
SET      50.943       57.500
SET      52.479       60.000
SET      54.271       62.500
SET      56.575       65.000
SET      59.391       67.500
SET      63.999       70.000
SET      70.143       72.500
SET      75.263       75.000
SET      77.311       76.250
SET      79.359       77.500
SET      80.895       78.750
SET      82.943       80.000
SET      84.479       81.250
SET      86.015       82.500
SET      87.551       83.750
SET      89.087       85.000
SET      90.623       86.250
SET      92.671       87.500
SET      93.183       88.125
SET      94.207       88.750
SET      95.231       89.375
SET      96.255       90.000
SET      97.791       90.625
SET      98.815       91.250
SET     100.863       91.875
SET     102.911       92.500
SET     105.983       93.125
SET     112.127       93.750
SET     116.735       94.062
SET     121.343       94.375
SET     126.463       94.688
SET     131.071       95.000
SET     137.215       95.312
SET     143.359       95.625
SET     150.527       95.938
SET     156.671       96.250
SET     160.767       96.562
SET     164.863       96.875
SET     167.935       97.031
SET     172.031       97.188
SET     176.127       97.344
SET     180.223       97.500
SET     184.319       97.656
SET     187.391       97.812
SET     190.463       97.969
SET     194.559       98.125
SET     199.679       98.281
SET     203.775       98.438
SET     205.823       98.516
SET     207.871       98.594
SET     209.919       98.672
SET     210.943       98.750
SET     212.991       98.828
SET     216.063       98.906
SET     218.111       98.984
SET     221.183       99.062
SET     224.255       99.141
SET     227.327       99.219
SET     229.375       99.258
SET     232.447       99.297
SET     235.519       99.336
SET     239.615       99.375
SET     243.711       99.414
SET     247.807       99.453
SET     252.927       99.492
SET     259.071       99.531
SET     264.191       99.570
SET     270.335       99.609
SET     274.431       99.629
SET     280.575       99.648
SET     286.719       99.668
SET     290.815       99.688
SET     296.959       99.707
SET     301.055       99.727
SET     307.199       99.746
SET     309.247       99.766
SET     313.343       99.785
SET     321.535       99.805
SET     323.583       99.814
SET     327.679       99.824
SET     329.727       99.834
SET     331.775       99.844
SET     335.871       99.854
SET     339.967       99.863
SET     339.967       99.873
SET     344.063       99.883
SET     348.159       99.893
SET     352.255       99.902
SET     356.351       99.907
SET     356.351       99.912
SET     360.447       99.917
SET     360.447       99.922
SET     364.543       99.927
SET     366.591       99.932
SET     368.639       99.937
SET     370.687       99.941
SET     374.783       99.946
SET     376.831       99.951
SET     376.831       99.954
SET     378.879       99.956
SET     380.927       99.958
SET     380.927       99.961
SET     380.927       99.963
SET     382.975       99.966
SET     382.975       99.968
SET     382.975       99.971
SET     385.023       99.973
SET     387.071       99.976
SET     387.071       99.977
SET     387.071       99.978
SET     389.119       99.979
SET     393.215       99.980
SET     395.263       99.982
SET     395.263       99.983
SET     397.311       99.984
SET     399.359       99.985
SET     399.359       99.987
SET     401.407       99.988
SET     403.455       99.988
SET     403.455       99.989
SET     403.455       99.990
SET     403.455       99.990
SET     403.455       99.991
SET     405.503       99.991
SET     405.503       99.992
SET     409.599       99.993
SET     411.647       99.993
SET     411.647       99.994
SET     419.839       99.994
SET     419.839       99.995
SET     419.839       99.995
SET     419.839       99.995
[...]
SET     421.887       99.996
SET     421.887       99.996
SET     421.887       99.996
SET     423.935       99.997
SET     423.935       99.997
SET     423.935       99.997
[...]
SET     425.983       99.997
SET     425.983       99.998
SET     425.983       99.998
SET     425.983       99.998
SET     428.031       99.998
SET     428.031       99.998
SET     428.031       99.998
[...]
SET     428.031       99.999
SET     428.031       99.999
SET     428.031       99.999
[...]
SET     430.079       99.999
SET     430.079       99.999
SET     430.079       99.999
[...]
SET     430.079      100.000
SET     434.175      100.000
SET     434.175      100.000
SET     434.175      100.000
[...]
SET     436.223      100.000
SET     436.223      100.000
---
GET       0.000      100.000
---
WAIT      0.000      100.000